# Question 1

In [1]:
# Given Code
a = 0
def b():
    global a
    a = c(a)
def c(a):
    return a + 2

In [2]:
b()
b()
b()
a

6

#### Code Review
> a is global variable, and associated value is 0

> function b creates a copy of global variable to modify global variable a. Then, it's calling function c and updating global variable

> Function c will take an argument of global variable copy and returns the variable with increment of 2

#### Calling functions and their description
> a = 0
> First time, when function b is called, global variable updates it's value. value of a variable will be 2. 
> Second time, when function b is again called, global variable increment it's value, and finalize itself at 4.
> When third time function b is called, globla variable's value becomes 6. 

> Final output: 6

# Question 2

### Given Code

In [3]:
def file_length(file_name):
    file = open(file_name)
    contents = file.read()
    file.close()
    print(len(contents))

In [4]:
file_length("MidTerm.txt")

5

In [5]:
file_length("MidTerm1.txt")

FileNotFoundError: [Errno 2] No such file or directory: 'MidTerm1.txt'

### Updated Code

In [6]:
# Frindly error message
def file_length(file_name):
    try:
        file = open(file_name)
        contents = file.read()
        file.close()
        print(len(contents))
    except FileNotFoundError:
        print("File " + file_name + " is not found.")
    except UnicodeDecodeError:
        print("File " + file_name + " is not in text format.")
    except:
        print("Please check your file.")

#### Testing function

In [7]:
file_length("MidTerm1.txt")

File MidTerm1.txt is not found.

In [8]:
file_length("MidTerm.txt")

5

In [9]:
file_length("Lab.rar")

File Lab.rar is not in text format.

# Question 3

In [10]:
# Class marsupial
class Marsupial:
    def __init__(self):
        self.pouch = []
    # Function to append content
    def put_in_pouch(self,content):
        self.pouch.append(content)
    # To know the content
    def pouch_contents(self):
        print(self.pouch)

In [11]:
m = Marsupial()
m.put_in_pouch('doll')
m.put_in_pouch('firetruck')
m.put_in_pouch('kitten')
m.pouch_contents()

['doll', 'firetruck', 'kitten']

In [12]:
# Inherit Marsupial, and implementing jump functionality
class Kangaroo(Marsupial):
    def __init__(self, x, y):
        super().__init__()
        self.x = x
        self.y = y
    def jump(self, dx, dy):
        self.x += dx
        self.y += dy
            
    def __str__(self):
        return "I am a Kangaroo located at coordinates ( " + str(self.x) + ', ' + str(self.y) + ' )'

In [13]:
k = Kangaroo(0,0)
print(k)

I am a Kangaroo located at coordinates ( 0, 0 )

In [14]:
k.put_in_pouch('doll')
k.put_in_pouch('firetruck')
k.put_in_pouch('kitten')
k.pouch_contents()

['doll', 'firetruck', 'kitten']

In [15]:
k.jump(1,0)
k.jump(1,0)
k.jump(1,0)
print(k)

I am a Kangaroo located at coordinates ( 3, 0 )

# Question 4

In [16]:
def collatz(x):
    if not isinstance(x, int):
        print("Function only takes integer values. Please input accordingly.")
        return
    print(x)
    if x == 1:
        return
    elif x % 2 == 0:
        collatz(int(x /2))
    else:
        collatz(int(x * 3 + 1))

In [17]:
collatz(10.01)

Function only takes integer values. Please input accordingly.

In [18]:
collatz(10)

10
5
16
8
4
2
1

# Question 5

In [19]:
def binary(x):
    if not isinstance(x, int):
        print("Function only takes integer values. Please input accordingly.")
        return
    else:
        if(x > 1):
            binary(int(x / 2))
        print(x%2, end = '')

In [20]:
binary(0)

0

In [21]:
binary(1)

1

In [22]:
binary(3)

11

In [23]:
binary(9)

1001

# Question 6

In [24]:
from html.parser import HTMLParser

class HeadingParser(HTMLParser):
    def __init__(self):
        super().__init__()
        self.indentation = 0
        self.headings = []

    def handle_starttag(self, tag, attrs):
        if tag in ['h1', 'h2', 'h3', 'h4', 'h5', 'h6']:
            self.indentation = int(tag[1:]) - 1
        if tag == 'title':
            self.indentation = -1

    def handle_endtag(self, tag):
        if tag in ['h1', 'h2', 'h3', 'h4', 'h5', 'h6']:
            self.indentation = 0

    def handle_data(self, data):
        if self.indentation >= 0:
            self.headings.append('')
        if self.indentation >= 0:
            self.headings.append(' ' * self.indentation + data.strip())

    def print_headings(self):
        for heading in self.headings:
            if heading != '':
                print(heading)

In [25]:
infile = open('w3c.html')
content = infile.read()
infile.close()

hp = HeadingParser()
hp.feed(content)
hp.print_headings()

W3C Mission
 Principles

# Question 7

In [26]:
import requests
from bs4 import BeautifulSoup

def webdir(url, depth, indent):
    if depth < 0:
        return
    
    res = requests.get(url)
    soup = BeautifulSoup(res.text, 'html.parser')
    
    print( ' ' * indent + url)
    
    if depth == 0:
        return
    
    for link in soup.find_all('a'):
        href = link.get('href')
        if href.startswith('http'):
            webdir(href, depth - 1, indent + 4)

In [27]:
webdir('http://reed.cs.depaul.edu/lperkovic/csc242/test1.html', 2, 0)

http://reed.cs.depaul.edu/lperkovic/csc242/test1.html

# Question 8

In [28]:
import sqlite3

connection = sqlite3.connect("temperature.db")
crsr = connection.cursor()

In [29]:
# Creating table
sql_command = """DROP TABLE IF EXISTS seasons"""
crsr.execute(sql_command)


sql_command = """CREATE TABLE seasons (
City VARCHAR(50),
Country VARCHAR(20),
Season VARCHAR(30),
Temperature REAL,
Rainfall REAL);"""

crsr.execute(sql_command)

In [30]:
# Inserting the data

sql_command = """
INSERT INTO seasons (City, Country, Season, Temperature, Rainfall) VALUES ('Mumbai', 'India', 'Winter', 24.8, 5.9),
('Mumbai', 'India', 'Spring', 28.4, 16.2),
('Mumbai', 'India', 'Summer', 27.9, 1549.4),
('Mumbai', 'India', 'Fall', 27.6, 346.0),
('London', 'United Kingdom', 'Winter', 4.2, 207.7),
('London', 'United Kingdom', 'Spring', 8.3, 169.6),
('London', 'United Kingdom', 'Summer', 15.7, 157.0),
('London', 'United Kingdom', 'Fall', 10.4, 218.5),
('Cairo', 'Egypt', 'Winter', 13.6, 16.5),
('Cairo', 'Egypt', 'Spring', 20.7, 6.5),
('Cairo', 'Egypt', 'Summer', 27.7, 0.1),
('Cairo', 'Egypt', 'Fall', 22.2, 4.5)
"""

crsr.execute(sql_command)

In [31]:
import pandas as pd
def printTableData(command):
    #crsr.execute(command)
    df = pd.read_sql(sql=command, con=connection)
    return df
    #results = crsr.fetchall()
    #print(crsr.description())
    #for row in results:
     #   print(row)

In [32]:
import pandas as pd
# To check the table content
sql_command = """
SELECT * FROM seasons
"""
printTableData(sql_command)

      City         Country  Season  Temperature  Rainfall
0   Mumbai           India  Winter         24.8       5.9
1   Mumbai           India  Spring         28.4      16.2
2   Mumbai           India  Summer         27.9    1549.4
3   Mumbai           India    Fall         27.6     346.0
4   London  United Kingdom  Winter          4.2     207.7
5   London  United Kingdom  Spring          8.3     169.6
6   London  United Kingdom  Summer         15.7     157.0
7   London  United Kingdom    Fall         10.4     218.5
8    Cairo           Egypt  Winter         13.6      16.5
9    Cairo           Egypt  Spring         20.7       6.5
10   Cairo           Egypt  Summer         27.7       0.1
11   Cairo           Egypt    Fall         22.2       4.5

In [33]:
# 8.1 All the temperature data

sql_command = """
SELECT Temperature FROM seasons
"""
printTableData(sql_command)

    Temperature
0          24.8
1          28.4
2          27.9
3          27.6
4           4.2
5           8.3
6          15.7
7          10.4
8          13.6
9          20.7
10         27.7
11         22.2

In [34]:
# 8.2 All the cities, but without repetition

sql_command = """
SELECT DISTINCT City FROM seasons
"""
printTableData(sql_command)

     City
0  Mumbai
1  London
2   Cairo

In [35]:
# 8.3 All the record for india

sql_command = """
SELECT * FROM seasons WHERE Country = 'India'
"""
printTableData(sql_command)

     City Country  Season  Temperature  Rainfall
0  Mumbai   India  Winter         24.8       5.9
1  Mumbai   India  Spring         28.4      16.2
2  Mumbai   India  Summer         27.9    1549.4
3  Mumbai   India    Fall         27.6     346.0

In [36]:
# 8.4 All the fall record

sql_command = """
SELECT * FROM seasons WHERE Season = 'Fall'
"""
printTableData(sql_command)

     City         Country Season  Temperature  Rainfall
0  Mumbai           India   Fall         27.6     346.0
1  London  United Kingdom   Fall         10.4     218.5
2   Cairo           Egypt   Fall         22.2       4.5

In [37]:
# 8.5 The city, country, and season for which the average rainfall is between 200 and 400 millimeters

sql_command = """
SELECT City, Country, Season FROM seasons WHERE Rainfall BETWEEN 200 AND 400
"""
printTableData(sql_command)

     City         Country  Season
0  Mumbai           India    Fall
1  London  United Kingdom  Winter
2  London  United Kingdom    Fall

In [38]:
# 8.6 The city and country for which the average Fall temperature is above 20 degrees, in increasing temperature order.

sql_command = """
SELECT City, Country FROM seasons WHERE Temperature > 20 ORDER BY Temperature
"""
printTableData(sql_command)

     City Country
0   Cairo   Egypt
1   Cairo   Egypt
2  Mumbai   India
3  Mumbai   India
4   Cairo   Egypt
5  Mumbai   India
6  Mumbai   India

In [39]:
# 8.7 The total annual rainfall for Cairo.

sql_command = """
SELECT SUM(Rainfall) as 'Total Annal Rainfall' FROM seasons WHERE CITY = 'Cairo'
"""
printTableData(sql_command)

   Total Annal Rainfall
0                  27.6

In [40]:
# 8.8 The total rainfall for each season

sql_command = """
SELECT Season, SUM(Rainfall) as 'Total Rainfall' FROM seasons GROUP BY Season
"""
printTableData(sql_command)

   Season  Total Rainfall
0    Fall           569.0
1  Spring           192.3
2  Summer          1706.5
3  Winter           230.1

In [41]:
# Closing sql connection

connection.commit()
connection.close()

# Question 9

In [42]:
words = ['The', 'quick', 'brown', 'fox', 'jumps', 'over', 'the', 'lazy', 'dog']

In [43]:
# To upper
words_up = [word.upper() for word in words]
words_up

['THE', 'QUICK', 'BROWN', 'FOX', 'JUMPS', 'OVER', 'THE', 'LAZY', 'DOG']

In [44]:
# To lower
words_lower = [word.lower() for word in words]
words_lower

['the', 'quick', 'brown', 'fox', 'jumps', 'over', 'the', 'lazy', 'dog']

In [45]:
# Counts

words_count = [len(word) for word in words]
words_count

[3, 5, 5, 3, 5, 4, 3, 4, 3]

In [46]:
# Upper, Lower, Count

words_count = [[word.upper(), word.lower(), len(word)] for word in words]
words_count

[['THE', 'the', 3],
 ['QUICK', 'quick', 5],
 ['BROWN', 'brown', 5],
 ['FOX', 'fox', 3],
 ['JUMPS', 'jumps', 5],
 ['OVER', 'over', 4],
 ['THE', 'the', 3],
 ['LAZY', 'lazy', 4],
 ['DOG', 'dog', 3]]

In [47]:
# Words having length greater than 4
words_count = [word for word in words if len(word) >= 4]
words_count

['quick', 'brown', 'jumps', 'over', 'lazy']